import random
import time

def autoincorrect(word):
    """
    Function to replace a word with an autoincorrect version.
    """
    return "ĉ̶̡̢̤̭̠͕̜͖͔̜͖͎̟͈͉̭̼͖̼̣̠̪̲̞̻̙̖̗̖̞̯͓̿̏̊̈́̑͗̂̑̌̀̑̄̌͆̊͂̕͜͝ͅͅͅr̴̙̲̼͚̮̫̬̺̫͇͎̪̽̊́̿̍͒̓̎́́̾̊̕͠ͅa̵̢̧̛͔̠̐̑̿̃̾̈́́͒̎͒͒̈̏̓̑̓̋̐̽̏̃̏̔̚̚͘͘͘͠s̶̛͍͈̲̥̩͍̫̜̭͓̫̘̹̰͐͗̌̈̇̌̈́̿̊̍̓́͂̊͐̾̽̔͗̾̔̈́͂̇̐̃̉̃͊́̉̿̊̈́̒̒̉̑̐͋̚̕̕͝͝͠͝͠͠h̸̳͎̭̼͚̥̱͎̮̮͕͇̭͎͓̞̮̙̰͆͋̾́͛̓͒̓̚͘"
      

def autoincorrect_sentence(sentence):
    """
    Function to apply autoincorrect to a whole sentence.
    """
    words = sentence.split()
    autoincorrected_words = [autoincorrect(word) for word in words]
    return " ̵̨̡̧̡̲͕͈͕̮͓̩͓̭̗͈͓͚̪̳̼̜̱͔̠̟̥̱̺̖̰̰̠͕̖̰͕̈́̋͗̀͗̄̓̂̃̏̏̓̇͒̈́̽͋̊̓̍͛̓͂̈̆͊̀̂͂̃̄̅͐͌̕͝͝͝ͅ".join(autoincorrected_words)

def asksentence():
    sentence = input("Ȩ̷̥̰̼̦̣͎̱̗̓͒̀̾̾̌͋̀̅̀̊͑͛̂̓̕͜͝͝ͅn̸̡̨̡̨̫̜͎̖̱͕̘̦̻̫̩̻͙͙̱̹̻̤̫̮̺̘̙̖̩͈͓̤̼͉̣͕̘̭͉͓͈͕̫̳̠̍̍͆̊̈̎̐͋̉̓̎͒͛͒͒̋̇̐͆̑̍̇͋̍́̊͐́͛̾̚͝͝͝͠ͅͅͅͅt̶̢̧̢̢̛̞̤̩̦͇̞̮̼̯̙͖̝̯̻̳̩̘̫̝̟͕͎͕̗͉̟̳̞͚͓̱̦̘̣͕̤́̆͌̊̾̆͐̉̿̈͊̕͜͜ͅȩ̵̡̧̤̮̘̺̖̳͚͙̩̲̳͙͚̭͙̘͈̦͉͇͓̞̰̱̯̹̥̣͓̗̤̗͕̯̤͔͖̦͚͇̱̬̊̍̿͂̚͜͜͜ͅr̶̨̖̭̮̭̘͎̖̩̥̝̻̞̣̃̐̀͆̅̏̊̄͛̐́́̐̾̈́̉̒̀̌̇͌̎͒̒̓̔͌͛̑̀̓̎̌͠͝͝͠͠͝͝ ̷̡͈̒͋̈́̆̾̓̽͂̈́̊͝t̷̢̪̦̲̮̭̗͇͙͐͐̈́̐̓̾̀͂̔̌̓̒͌͌̇̉͛̆͒̃̋̓̿̿͊̍͘̚͝͠ͅe̵̢̧̛̻̠̩̝̻̬̝̖̦̙̞̱̞͖̟̫̬̳̗͓̖̟̲̦͖̜̥̰̫͙̟̩̭̯͕̘͕͙̤̱̫̙̻͖̣̭̗̊́̎̀͐̊̎̔̆̈́͌̋̆̄̆̈́̏̀̂͒̄̂̏̎͐̔̆̏͗̀̌͝͝͝͝x̸͈̲͍̗̥͍̂̓̀̋̐̅́̒̾̀̏̈̈́͂́̀͆̌̓͌̿̒̓̓̍̔̔̌͗̈́͊͂̇̏̌͂̓̊̚͜͝͝͝͠͠t̸̡̡̢̡̛̛̩͙̼͉̲̜̯̫̟̲̝̙̲̲͓̰̘̻͎̩̗̮͈̱̖͓̺̦̭̲͕̺̬̼͇̤̜͕̐̀̓͆̌̈́̐͗͑̋̈́̈́͊͋͋͑͌̈́̔͌͊̆̈́̔́̃̓̑̏̑́̏͛͋̍̅̾͗͜͜͜͝͠͠͝͝ ̸̢̢̡̘̞̖̟͓̮̣͓͕̰͕̙͖̝̼̻͍͖͈̱̭̌͛̉́̀̈́̍̊̒̀̋͐͋͘̕͝͝ͅţ̶̢̹̪͈̻͈͎͚̻͙̮͇̭̖̹̥̘̹̩̺̤̹̻̲̯̮͇͙͇̙̜̫̫̪͕͔̗͈͈͎͎͊͆̈͗̂̑͆̀̌͑̅̅̑̿͗̉̈́͛̚͘͘͜͜͜͠ͅͅͅo̸̡̧͙̺̣͉̼͕͍̎̋̎̉͒́̄̄̓͌̎̈͋̓͂́͐̊̇́̓̾̽̐̀̈́̽́̊̒̇̕͘͜͝͝͝ͅ ̷̡̨̛̛͓̼̳̝̭̦̮̣̥̟̳͎͖̲͇̙̫͚͇͇̩̟̪̦̘̙̜̙̜͍̻̗̦͛̈́̏̂̆̊̾̑͐̎̀͒͊̑̈́̍́̐̽͊̅̊͗̂̆̇̍͛̓̎̆̚̚̕͘͘͜͝ͅͅͅḁ̴̢̨̢̢̡̡̢̢̛̭͔̩̖̝̳̦̳͙̩͖̲̠͈̙̟̪̤̖̩͇̪̜͇̤̻͖͚͔̼̲̜̻̦̼̼͈͍̊̀͒̐̄͐͒̀̂́̃̌́͂̑̑́̆̈́͋͋́̌͑͋͆̀̑͛͌̅̽̈́̉̆̊̏͗̄̈́͘̕͘̕͜͝͝͠͝͝ͅu̷̢̨̟̰̖̰͊͠t̵̢̡̡̧̛̠̭̜̹͚͓̯͕̘̦̪͈͎̜͕̳͓̥̯̯̘̻̼̟͙͚̥͈͖̱̠̃͆̒̄̅͐̃̽̌͗̇̉̂̓̽̃̍͌̈́̿̑̌̐̕ͅö̵̢̧̥̬̙͉̦̗͈̟̜̤̱̮͍̫̯͇͓̙̬͍̺̙͚̖̲̹̻̟́̊̄̈́̉͘̕͝͠ḯ̶̧̨̡̡̬͕͈̫͈͙̟͕͍̼̳̤̖̮̖͉̳͇̫͈͉́̊͋͋̈́͂̈̄̇͘͜͝͝͠ͅń̶̪͔̮̦̎̐͛͋̂̐̅̇͒̈̊̾̾̓͐͌̃̎̂͒͗̈́͑͊̇̆̒̽͑͐͘͘͝͝ḉ̴͔̱̗̳͎̖͇͚̳͈̖̼̖̣͎̹͉͎͈̽̓̀̏̿̑͒̐̇̌͆͆̾͌̿͌͊̎͂̓̐̓̋̾͊͌̌̈́͛̒̓̓̈́̑͑͊͋̽̄̒͘̕̕̕̚̚͝ͅó̵̩̭̺̙̦̟̠̗͈͉͈͈̩̰͓̘̥͍̘̣͉͕̩͕̺̻̗͎̣͆̈̀͐͑̄͊͂̾̈̈́̃̓̈́̋̃̀̔̂̿͒͌̔̇̿̒͆̕̚r̷̡̢͔͍̫̺̲̭̣̰̗̘͔͇̤̟͖͈̗̳̾̈́͆̒́̆͌̌̀̌̓̑̀̿̈̀̽̓͂͊ͅr̵͔̭̯͈̝͍̪͇̣͛̅e̵̛͚̝͖͔̼̰̫̤̹̠͎̻̥̣̣̦̔̈́̍̃̈́̚̚͜c̷̡̧̱̳̜͔̩̘͖͙̜͔̻͇͓̼̺̮͕͓͙͇̘͍̳̼̼̪̖͇̞̗͆̏̆̈́́̂̓̋̈́͗̆̃̅̃̄͂̚͜͠ͅţ̵̧̩̗̦̪͎̻̱̬̬̮̫̥̟̖͍͊͐̈́̀͑̅͒̅́̃̆̈́̓̈̏̆̆̄̌̂̾͂̀̒̈́̎̌̌́̍̐̕͘͘͝͝:̵̧̣̩̰̻̱͙̦̻̼̙̱͊̀̅͛͋̈́́͒͑̿̓̿̿͛̿̈̈́̂̏̚͘͝͠͝ ̷̡̧̨̲͖̞̗̲̠̥̞͇̗͔̥͔͕̟̙̺̭͈͉̞͍͍̻̊̔͘ͅͅ")
    incorrectsentence = autoincorrect_sentence(sentence)
    print(incorrectsentence)
    asksentence()

asksentence()
